app/Models/BrandModel.php

    public function getActive(): array
    {
        return $this->orderBy('name', 'ASC')->findAll();
---
SELECT *
FROM "brands"
ORDER BY "name" ASC