app/Models/CityBoundaryModel.php

    public function getActiveBoundary(?string $slug = 'kota-medan'): ?array
    {
        $builder = $this->where('is_active', true)->orderBy('id', 'ASC');

        if ($slug !== null) {
            $builder->where('slug', $slug);
        }

        return $builder->first();
---
SELECT *
FROM "city_boundaries"
WHERE "is_active" = TRUE
AND "slug" = 'kota-medan'
ORDER BY "id" ASC
 LIMIT 1