app/Models/DistrictModel.php

SELECT *
FROM "districts"
WHERE "is_active" = TRUE
ORDER BY "name" ASC
---
    public function getAllForMap(): array
    {
        return $this->where('is_active', true)->orderBy('name', 'ASC')->findAll();